meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pClient/STM32CubeIDE/Application/User/STM32_WPAN/App/p2p_client_app.c
#if(CFG_DEBUG_APP_TRACE != 0)
  APP_DBG_MSG("-- P2P CLIENT INITIALIZED \n");
#endif

/* USER CODE BEGIN P2PC_APP_Init_2 */

/* USER CODE END P2PC_APP_Init_2 */
  return;
}

void P2PC_APP_Notification(P2PC_APP_ConnHandle_Not_evt_t *pNotification)
{
/* USER CODE BEGIN P2PC_APP_Notification_1 */

/* USER CODE END P2PC_APP_Notification_1 */
  switch(pNotification->P2P_Evt_Opcode)
  {
/* USER CODE BEGIN P2P_Evt_Opcode */

/* USER CODE END P2P_Evt_Opcode */

  case PEER_CONN_HANDLE_EVT :
/* USER CODE BEGIN PEER_CONN_HANDLE_EVT */
	  P2P_Client_App_Context.ConnectionHandle = pNotification->ConnectionHandle;

	      APP_DBG_MSG("\n===========================================\n");
	      APP_DBG_MSG("    CLIENT BAŞARIYLA BAĞLANDI!\n");
	      APP_DBG_MSG("    Server ismi: %s\n", target_device_name);
	      APP_DBG_MSG("===========================================\n\n");

	      // LED durumları
	      BSP_LED_Off(LED_RED);    // Arama LED'i kapat
	      BSP_LED_On(LED_BLUE);    // Bağlı LED'i yak
	      BSP_LED_Off(LED_GREEN);  // Yeşil LED kapat

	      // Auto disconnect timer'ı kaldır - sürekli bağlı kal
	      // Sadece server disconnect ettiğinde kopsun

	      break;
/* USER CODE END PEER_CONN_HANDLE_EVT */
      break;

  case PEER_DISCON_HANDLE_EVT :
  {
      APP_DBG_MSG("=== CLIENT SERVER'DAN KOPTU ===\n");

      // Tüm client context'leri temizle
      uint8_t index = 0;
      P2P_Client_App_Context.ConnectionHandle = 0x00;
      while((index < BLE_CFG_CLT_MAX_NBR_CB) && (aP2PClientContext[index].state != APP_BLE_IDLE)) {
          aP2PClientContext[index].state = APP_BLE_IDLE;
          index++;
      }

      BSP_LED_Off(LED_BLUE);  // Mavi LED kapat
      BSP_LED_On(LED_RED);    // Kırmızı LED yak (arama modunda)

      // HAL_Delay yerine timer kullan
      APP_DBG_MSG("=== 3 SANIYE SONRA YENIDEN TARAMA ===\n");

      // 3 saniye sonra yeniden tara
      HW_TS_Start(DisconnectTimerId, (uint32_t)(3 * 1000 * 1000 / CFG_TS_TICK_VAL));
  }
  break;
/* USER CODE BEGIN P2PC_APP_Notification_2 */

/* USER CODE END P2PC_APP_Notification_2 */
  return;
}
}
/* USER CODE BEGIN FD */
void P2PC_APP_SW1_Button_Action(void)
{

  UTIL_SEQ_SetTask(1<<CFG_TASK_SW1_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);

}
/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event)
{
  SVCCTL_EvtAckStatus_t return_value;
  hci_event_pckt *event_pckt;
  evt_blecore_aci *blecore_evt;

  return_value = SVCCTL_EvtNotAck;
  event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)Event)->data);

  switch(event_pckt->evt)
  {
    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      blecore_evt = (evt_blecore_aci*)event_pckt->data;
      switch(blecore_evt->ecode)
      {
      /* USER CODE BEGIN NEW_CASES */

                      /*
                       * GATT Read Response - Server'dan veri geldi
                       *
                       * Bu case ne zaman tetiklenir?
                       * - ReadCustomData() çağırdığımızda
                       * - Server veriyi gönderince
                       */
      case ACI_ATT_READ_RESP_VSEVT_CODE: {
          aci_att_read_resp_event_rp0 *pr = (void*)blecore_evt->data;

          APP_DBG_MSG("=== CLIENT: DATA RECEIVED FROM SERVER ===\n");
          APP_DBG_MSG("Connected to server: %s\n", target_device_name);
          APP_DBG_MSG("Received data length: %d bytes\n", pr->Event_Data_Length);

          if (pr->Event_Data_Length == 30) {
              APP_DBG_MSG("Received Data (30 bytes): ");
              for (int i = 0; i < 30; i++) {
                  APP_DBG_MSG("%02X ", pr->Attribute_Value[i]);
                  if ((i + 1) % 10 == 0) APP_DBG_MSG("\n                         ");
              }
              APP_DBG_MSG("\nData successfully received from server\n");

              // Veriyi kopyala
              memcpy(ReceivedCustomData, pr->Attribute_Value, 30);
              CustomReadCount++;

              // LED: Mavi - Veri alındı
              BSP_LED_Off(LED_GREEN);
              BSP_LED_On(LED_BLUE);

              // 2 saniye sonra confirmation gönder
              APP_DBG_MSG("Sending data received confirmation to server...\n");
              HAL_Delay(2000);
              SendDataReceivedConfirmation();  // Bu satır artık çalışacak

          } else {
              APP_DBG_MSG("ERROR: Unexpected data length received\n");
          }
          break;
      }

                      /*
                       * GATT Notification - Server bildirim gönderdi
                       *
                       * Bu case ne zaman tetiklenir?
                       * - Server veri değiştiğinde
                       * - Notification açıksa otomatik gelir
                       */
                      case ACI_GATT_NOTIFICATION_VSEVT_CODE: {
                          aci_gatt_notification_event_rp0 *pr = (void*)blecore_evt->data;
                          uint8_t index;

                          // Debug yazdır
                          APP_DBG_MSG("=== NOTIFICATION GELDI ===\n");
                          APP_DBG_MSG("Handle: 0x%04X\n", pr->Attribute_Handle);
                          APP_DBG_MSG("Veri uzunluğu: %d byte\n", pr->Attribute_Value_Length);

                          // Client context bul
                          index = 0;
                          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                                (aP2PClientContext[index].connHandle != pr->Connection_Handle))
                              index++;

                          if(index < BLE_CFG_CLT_MAX_NBR_CB) {

                              // P2P Service notification mı kontrol et
                              if ((pr->Attribute_Handle == aP2PClientContext[index].P2PNotificationCharHdle) &&
                                  (pr->Attribute_Value_Length == 2)) {

                                  // P2P notification işle
                                  P2P_Client_App_Notification_evt_t Notification;
                                  Notification.P2P_Client_Evt_Opcode = P2P_NOTIFICATION_INFO_RECEIVED_EVT;
                                  Notification.DataTransfered.Length = pr->Attribute_Value_Length;
                                  Notification.DataTransfered.pPayload = &pr->Attribute_Value[0];
                                  Gatt_Notification(&Notification);

                              } else {
                                  // Custom service notification (diğer handle'lar için)
                                  if (pr->Attribute_Value_Length > 0) {
                                      PrintReceivedData(&pr->Attribute_Value[0], pr->Attribute_Value_Length, "NOTIFICATION");
                                  }
                              }
                          }
                          break;
                      }

                      /* USER CODE END NEW_CASES */
        case ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
        {
          aci_att_read_by_group_type_resp_event_rp0 *pr = (void*)blecore_evt->data;
          uint8_t numServ, i, idx;
          uint16_t uuid, handle;

