meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pClient/STM32CubeIDE/Application/User/STM32_WPAN/App/p2p_client_app.c
          /*
           * event data will be of the format
           * 2 bytes handle
           * 2 bytes UUID
           */

          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aP2PClientContext[index].connHandle != pr->Connection_Handle))

            index++;

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {

            numDesc = (pr->Event_Data_Length) / 4;
            /* we are interested only in 16 bit UUIDs */
            idx = 0;
            if (pr->Format == UUID_TYPE_16)
            {
              for (i=0; i<numDesc; i++)
              {
                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx]);
                uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx+2]);

                if(uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID)
                {
#if(CFG_DEBUG_APP_TRACE != 0)
                  APP_DBG_MSG("-- GATT : CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID- connection handle 0x%x\n", aP2PClientContext[index].connHandle);
#endif
                  if( aP2PClientContext[index].state == APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC)
                  {

                    aP2PClientContext[index].P2PNotificationDescHandle = handle;
                    aP2PClientContext[index].state = APP_BLE_ENABLE_NOTIFICATION_DESC;

                  }
                }
                idx += 4;
              }
            }
          }
        }
        break; /*ACI_ATT_FIND_INFO_RESP_VSEVT_CODE*/


        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gatt_proc_complete_event_rp0 *pr = (void*)blecore_evt->data;
#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("-- GATT : ACI_GATT_PROC_COMPLETE_VSEVT_CODE \n");
          APP_DBG_MSG("\n");
#endif

          uint8_t index;

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aP2PClientContext[index].connHandle != pr->Connection_Handle))
            index++;

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {

            UTIL_SEQ_SetTask( 1<<CFG_TASK_SEARCH_SERVICE_ID, CFG_SCH_PRIO_0);

          }
        }
        break; /*ACI_GATT_PROC_COMPLETE_VSEVT_CODE*/
        default:
          break;
      }
    }

    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

    default:
      break;
  }

  return(return_value);
}/* end BLE_CTRL_Event_Acknowledged_Status_t */

void Gatt_Notification(P2P_Client_App_Notification_evt_t *pNotification)
{
/* USER CODE BEGIN Gatt_Notification_1*/

/* USER CODE END Gatt_Notification_1 */
  switch(pNotification->P2P_Client_Evt_Opcode)
  {
/* USER CODE BEGIN P2P_Client_Evt_Opcode */

/* USER CODE END P2P_Client_Evt_Opcode */

  case P2P_NOTIFICATION_INFO_RECEIVED_EVT:
  /* USER CODE BEGIN P2P_NOTIFICATION_INFO_RECEIVED_EVT */
  {
      uint8_t *data = pNotification->DataTransfered.pPayload;
      uint8_t length = pNotification->DataTransfered.Length;

      APP_DBG_MSG("=== CLIENT: P2P NOTIFICATION RECEIVED ===\n");
      APP_DBG_MSG("Length: %d bytes\n", length);

      // Raw data göster (debugging için)
      APP_DBG_MSG("Raw data: ");
      for(int i = 0; i < length; i++) {
          APP_DBG_MSG("%02X ", data[i]);
      }
      APP_DBG_MSG("\n");

      // 2-BYTE PAKET SİSTEMİ (YENİ)
      if(length == 2) {
          uint8_t group = data[0];
          uint8_t byte_data = data[1];
          static uint8_t first_group_count = 0;
          static uint8_t second_group_count = 0;

          APP_DBG_MSG("2-byte packet: Group=%d, Data=%02X\n", group, byte_data);

          if(group == 0x01) {
              // İlk 15 byte grubu
              ReceivedData[first_group_count] = byte_data;
              first_group_count++;
              APP_DBG_MSG("Group 1: byte %d/15 received\n", first_group_count);

              if(first_group_count == 15) {
                  PacketStatus[0] = 1;
                  first_group_count = 0;
                  APP_DBG_MSG("Group 1 complete (bytes 0-14)\n");
              }

          } else if(group == 0x02) {
              // İkinci 15 byte grubu
              ReceivedData[15 + second_group_count] = byte_data;
              second_group_count++;
              APP_DBG_MSG("Group 2: byte %d/15 received\n", second_group_count);

              if(second_group_count == 15) {
                  PacketStatus[1] = 1;
                  second_group_count = 0;
                  APP_DBG_MSG("Group 2 complete (bytes 15-29)\n");
              }
          }

          // HER İKİ GRUP DA TAMAMLANDI MI?
          if (PacketStatus[0] && PacketStatus[1]) {
              ClientDataCount++;

              APP_DBG_MSG("\n=== CLIENT: COMPLETE 30-BYTE DATA RECEIVED ===\n");
              APP_DBG_MSG("Connected to server: %s\n", target_device_name);
              APP_DBG_MSG("Complete 30-byte data:\n");

              // 30-byte veriyi düzenli şekilde göster
              for (int i = 0; i < 30; i++) {
                  APP_DBG_MSG("%02X ", ReceivedData[i]);
                  if ((i + 1) % 10 == 0) {
                      APP_DBG_MSG("\n");
                  }
              }

              // Checksum hesapla
              uint16_t checksum = 0;
              for (int i = 0; i < 30; i++) {
                  checksum += ReceivedData[i];
              }
              APP_DBG_MSG("Checksum: 0x%04X (%d decimal)\n", checksum, checksum);
              APP_DBG_MSG("Data reception count: %lu\n", ClientDataCount);

              // LED: Mavi - Veri alındı
              BSP_LED_Off(LED_GREEN);
              BSP_LED_On(LED_BLUE);

              // Server'a confirmation gönder
              APP_DBG_MSG("Sending data received confirmation to server...\n");
              HAL_Delay(1000);
              SendDataReceivedConfirmation();

              // Paket status'unu reset et
              PacketStatus[0] = 0;
              PacketStatus[1] = 0;
          }
      } else {
          // Eski P2P LED notification (compatibility)
          APP_DBG_MSG("Legacy P2P notification (non-data packet)\n");
          // ... existing LED logic ...
      }
  }
  /* USER CODE END P2P_NOTIFICATION_INFO_RECEIVED_EVT */
  break;
/* USER CODE END P2P_NOTIFICATION_INFO_RECEIVED_EVT */
      break;

    default:
/* USER CODE BEGIN P2P_Client_Evt_Opcode_Default */

/* USER CODE END P2P_Client_Evt_Opcode_Default */
      break;
  }
/* USER CODE BEGIN Gatt_Notification_2*/

/* USER CODE END Gatt_Notification_2 */
  return;
}

