meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pClient/STM32CubeIDE/Application/User/STM32_WPAN/App/p2p_client_app.c
uint8_t P2P_Client_APP_Get_State( void ) {
  return aP2PClientContext[0].state;
}
/* USER CODE BEGIN LF */

// 1. ÖNCE PrintReceivedData
static void PrintReceivedData(uint8_t *data, uint16_t length, const char* source) {
    APP_DBG_MSG("\n=== CLIENT VERİ ALDI ===\n");
    APP_DBG_MSG("Kaynak: %s\n", source);
    APP_DBG_MSG("Uzunluk: %d byte\n", length);

    if (length == DATA_STORAGE_SIZE) {
        APP_DBG_MSG("--- CLIENT ALDIĞI VERİ (30 byte) ---\n");
        memcpy(ReceivedCustomData, data, DATA_STORAGE_SIZE);

        for (int i = 0; i < length; i++) {
            if (i % 8 == 0) {
                APP_DBG_MSG("\n[%02d-%02d]: ", i,
                           (i+7 < length) ? i+7 : length-1);
            }
            APP_DBG_MSG("%02X ", data[i]);
        }
        APP_DBG_MSG("\n\n");

        uint16_t checksum = 0;
        for (int i = 0; i < length; i++) {
            checksum += data[i];
        }

        APP_DBG_MSG("Client Checksum: 0x%04X (%d decimal)\n", checksum, checksum);
        CustomReadCount++;
        APP_DBG_MSG("Toplam okuma sayısı: %lu\n", CustomReadCount);
    }
    APP_DBG_MSG("==========================\n\n");
}

// 2. ReadCustomData
static void ReadCustomData(void) {
    if (P2P_Client_App_Context.ConnectionHandle != 0x00) {
        APP_DBG_MSG("=== CLIENT: READING SERVER DATA ===\n");

        if (CustomHandles.DiscoveryComplete && CustomHandles.StorageCharHandle != 0) {
            APP_DBG_MSG("Using Custom Service Handle: 0x%04X\n", CustomHandles.StorageCharHandle);

            tBleStatus ret = aci_gatt_read_char_value(
                P2P_Client_App_Context.ConnectionHandle,
                CustomHandles.StorageCharHandle
            );

            if (ret == BLE_STATUS_SUCCESS) {
                APP_DBG_MSG("Read request sent successfully\n");
            } else {
                APP_DBG_MSG("ERROR: Read request failed: 0x%x\n", ret);
            }
        } else {
            APP_DBG_MSG("WARNING: Custom service not ready, discovery status: %d\n",
                       CustomHandles.DiscoveryComplete);
            APP_DBG_MSG("Service Handle: 0x%04X, Storage Handle: 0x%04X\n",
                       CustomHandles.ServiceHandle, CustomHandles.StorageCharHandle);
        }
    } else {
        APP_DBG_MSG("ERROR: Not connected to server\n");
    }
}

// 3. SendDataReceivedConfirmation
static void SendDataReceivedConfirmation(void) {
    APP_DBG_MSG("=== CLIENT: SENDING DATA RECEIVED CONFIRMATION ===\n");

    uint8_t confirm_cmd[2] = {CMD_CLEAR_DATA_BYTE1, CMD_CLEAR_DATA_BYTE2};

    if (P2P_Client_App_Context.ConnectionHandle != 0x00) {
        tBleStatus ret = Write_Char(P2P_WRITE_CHAR_UUID, 0, confirm_cmd);

        if (ret == BLE_STATUS_SUCCESS) {
            APP_DBG_MSG("Data received confirmation sent to server\n");
            APP_DBG_MSG("Server will now clear data and disconnect\n");
        } else {
            APP_DBG_MSG("ERROR: Failed to send confirmation: 0x%x\n", ret);
        }
    } else {
        APP_DBG_MSG("ERROR: Not connected to server\n");
    }
}

// 4. AutoDisconnect_Timer_Callback
static void AutoDisconnect_Timer_Callback(void) {
    APP_DBG_MSG("=== CLIENT: RECONNECTION TIMER ===\n");
    UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
}

// 5. Write_Char (EXISTING FUNCTION - KEEP AS IS)
static tBleStatus Write_Char(uint16_t UUID, uint8_t Service_Instance, uint8_t *pPayload)
{
    tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
    uint8_t index;

    index = 0;
    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
            (aP2PClientContext[index].state != APP_BLE_IDLE))
    {
        switch(UUID)
        {
            case P2P_WRITE_CHAR_UUID:
                ret = aci_gatt_write_without_resp(aP2PClientContext[index].connHandle,
                                                 aP2PClientContext[index].P2PWriteToServerCharHdle,
                                                 2,
                                                 (uint8_t *)  pPayload);
                break;
            default:
                break;
        }
        index++;
    }
    return ret;
}

// 6. Button_Trigger_Received (UPDATE THIS)
void Button_Trigger_Received(void)
{
    APP_DBG_MSG("=== CLIENT: MANUAL DATA REQUEST ===\n");

    if(P2P_Client_App_Context.ButtonStatus.Button1 == 0x00) {
        P2P_Client_App_Context.ButtonStatus.Button1 = 0x01;
    } else {
        P2P_Client_App_Context.ButtonStatus.Button1 = 0x00;
    }

    Write_Char(P2P_WRITE_CHAR_UUID, 0, (uint8_t *)&P2P_Client_App_Context.ButtonStatus);

    if (P2P_Client_App_Context.ConnectionHandle != 0x00) {
        APP_DBG_MSG("Reading 30-byte data from server manually...\n");
        ReadCustomData();
    } else {
        APP_DBG_MSG("ERROR: Not connected to any server\n");
    }
}

// 7. Update_Service (EXISTING FUNCTION - KEEP AS IS)
void Update_Service()
{
    uint16_t enable = 0x0001;
    uint16_t disable = 0x0000;
    uint8_t index;

    index = 0;
    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
            (aP2PClientContext[index].state != APP_BLE_IDLE))
    {
        switch(aP2PClientContext[index].state)
        {
            case APP_BLE_DISCOVER_SERVICES:
                APP_DBG_MSG("P2P_DISCOVER_SERVICES\n");
                break;
            case APP_BLE_DISCOVER_CHARACS:
                APP_DBG_MSG("* GATT : Discover P2P Characteristics\n");
                aci_gatt_disc_all_char_of_service(aP2PClientContext[index].connHandle,
                                                  aP2PClientContext[index].P2PServiceHandle,
                                                  aP2PClientContext[index].P2PServiceEndHandle);
                break;
            case APP_BLE_DISCOVER_WRITE_DESC:
                APP_DBG_MSG("* GATT : Discover Descriptor of TX - Write  Characteristic\n");
                aci_gatt_disc_all_char_desc(aP2PClientContext[index].connHandle,
                                            aP2PClientContext[index].P2PWriteToServerCharHdle,
                                            aP2PClientContext[index].P2PWriteToServerCharHdle+2);
                break;
            case APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC:
                APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification  Characteristic\n");
                aci_gatt_disc_all_char_desc(aP2PClientContext[index].connHandle,
                                            aP2PClientContext[index].P2PNotificationCharHdle,
                                            aP2PClientContext[index].P2PNotificationCharHdle+2);
                break;
            case APP_BLE_ENABLE_NOTIFICATION_DESC:
                APP_DBG_MSG("* GATT : Enable Server Notification\n");
                aci_gatt_write_char_desc(aP2PClientContext[index].connHandle,
                                         aP2PClientContext[index].P2PNotificationDescHandle,
                                         2,
                                         (uint8_t *)&enable);
                aP2PClientContext[index].state = APP_BLE_CONNECTED_CLIENT;
                BSP_LED_Off(LED_RED);

                /* USER CODE BEGIN CONNECTED_CLIENT_AUTO_REQUEST */
                APP_DBG_MSG("=== CLIENT: READY TO RECEIVE DATA ===\n");
                APP_DBG_MSG("Waiting for P2P notifications from server...\n");
                /* USER CODE END CONNECTED_CLIENT_AUTO_REQUEST */
                break;
            case APP_BLE_DISABLE_NOTIFICATION_DESC:
                APP_DBG_MSG("* GATT : Disable Server Notification\n");
                aci_gatt_write_char_desc(aP2PClientContext[index].connHandle,
                                         aP2PClientContext[index].P2PNotificationDescHandle,
                                         2,
                                         (uint8_t *)&disable);
                aP2PClientContext[index].state = APP_BLE_CONNECTED_CLIENT;
                break;
            default:
                break;
        }
        index++;
    }
    return;
}

/* USER CODE END LF */
